/* Πρόγραμμα για τον έλεγχο λειτουργίας των κινητήρων στο αποχιονιστικό 2
 * Το πρόγραμμα λειτουργεί όλους τους κινητήρες μπροστά για 3 δευτερόλεπτα και 
 * μετά τους απενεργοποιεί για άλλα 3 δευτερόλεπτα. Η διαδικασία αυτή επαναλαμβάνεται
 * διαρκώς. Αν κάποιος κινητήρας κινείται ανάποδα μπορούμε να αντιστρέψουμε τα καλώδια του
 * στο Motor Driver Shield
 */ 
 
//Προσθέτουμε την βιβλιοθήκη για τον οδηγό των κινητήρων
#include <AFMotor.h>

//Δηλώνουμε τους 4 κινητήρες του οχήματος σε ποιες θέσεις είναι τοποθετημένα
AF_DCMotor motorL(3); //Οι δυο αριστερά κινητήρες στην θέση 3
AF_DCMotor motorR(4); //Οι δυο δεξιά κινητήρες στην θέση 3


//Στο setup γράφουμε τις εντολές που θα εκτελεστούν μια φορά στην αρχή
void setup() {
  //Ορίζουμε την ταχύτητα των κινητήρων
  motorR.setSpeed(200);
  motorL.setSpeed(200);
  
  //Απενεργοποιούμε τους κινητήρες
  motorR.run(RELEASE);
  motorL.run(RELEASE);
  
}

//Στο loop γράφουμε τις εντολές που θα εκτελούνται συνεχώς
void loop() {
  //Ενεργοποιούμε τους κινητήρες προς τα μπροστά για 3 δευτερόλεπτα
  motorR.run(FORWARD);
  motorL.run(FORWARD); 
  delay(3000);
  
  //Απενεργοποιούμε τους κινητήρες για 3 δευτερόλεπτα
  motorR.run(RELEASE);
  motorL.run(RELEASE); 
  delay(3000);
}
