/* Πρόγραμμα για τον έλεγχο λειτουργίας των κινητήρων στο αποχιονιστικό 2
 * Το πρόγραμμα λειτουργεί όλους τους κινητήρες μπροστά για 3 δευτερόλεπτα και 
 * μετά τους απενεργοποιεί για άλλα 3 δευτερόλεπτα. Η διαδικασία αυτή επαναλαμβάνεται
 * διαρκώς. Αν κάποιος κινητήρας κινείται ανάποδα μπορούμε να αντιστρέψουμε τα καλώδια του
 * στο Motor Driver Shield
 */ 
 
#include <AFMotor.h>    //Προσθέτουμε την βιβλιοθήκη για τον οδηγό των κινητήρων

AF_DCMotor motorL(3);   //Ονομάζουμε motorL τους 2 κινητήρες που είναι στην θέση 3 του οδηγού κινητήρων και είναι στο αριστερό μέρος
AF_DCMotor motorR(4);   //Ονομάζουμε motorR τους 2 κινητήρες που είναι στην θέση 4 του οδηγού κινητήρων και είναι στο δεξί μέρος


void setup() {
}

void loop() {
  motorR.run(FORWARD);    //Ενεργοποιούμε τους δεξιά κινητήρες να κινηθούν μπροστά
  motorR.setSpeed(200);   //Ορίζουμε την ταχύτητα των δεξιά κινητήρων μεταξύ του 0-255
  motorL.run(FORWARD);    //Ενεργοποιούμε τους αριστερά κινητήρες να κινηθούν μπροστά
  motorL.setSpeed(200);   //Ορίζουμε την ταχύτητα των αριστερά κινητήρων μεταξύ του 0-255
  delay(3000);            //Περιμένουμε 3 δευτερόλεπτα
   
  motorR.run(RELEASE);    //Απενεργοποιούμε τους δεξιά κινητήρες
  motorL.run(RELEASE);    //Απενεργοποιούμε τους αριστερά κινητήρες
  delay(3000);            //Περιμένουμε 3 δευτερόλεπτα
}
