/* Πρόγραμμα ελέγχου μονάδας IMU για το αποχιονιστικό 1
 * Σκοπός του προγράμματος είναι να κινήσουμε το όχημα μας ευθεία και αυτό να διατηρεί την πορεία του 
 * Η μονάδα IMU ελέγχει διαρκώς αν υπάρχουν αποκλίσεις στον άξονα Ζ και διορθώνει την πορεία αλλάζοντας την
 * ταχύτητα των κινητήρων κάθε πλευράς.
 */


//Βιβλιοθήκες
#include <MPU6050_tockn.h>  //Προσθέτουμε τις βιβλιοθήκες για την μονάδα IMU (γυροσκόπιο και το επιταχυνσιόμετρο)
#include <Wire.h>           //Προσθέτουμε τις βιβλιοθήκες για την μονάδα IMU (γυροσκόπιο και το επιταχυνσιόμετρο)
#include <AFMotor.h>        //Προσθέτουμε την βιβλιοθήκη για τον οδηγό των κινητήρων

//Μεταβλητές
MPU6050 imu(Wire);          //Δηλώνουμε την μονάδα IMU με το όνομα imu
AF_DCMotor motorFR(1);      //Μπροστά δεξιά κινητήρας στην θέση 1
AF_DCMotor motorFL(2);      //Μπροστά αριστερά κινητήρας στην θέση 2
AF_DCMotor motorBL(3);      //Πίσω αριστερά κινητήρας στην θέση 3
AF_DCMotor motorBR(4);      //Πίσω δεξιά κινητήρας στην θέση 4
float mZ;                   //Δηλώνω μια μεταβλητή που θα κρατάει τις μοίρες περιστροφής γύρω από τον άξονα Ζ

void setup() {
  Wire.begin();             //Ξεκινάμε την μονάδα IMU
  imu.begin();              //Ξεκινάμε την μονάδα IMU
  imu.calcGyroOffsets(true);//Ζητάμε από την μονάδα να κάνει την αρχική ρύθμιση (θέλει 3 δευτερόλεπτα)
  motorFR.run(FORWARD);     //Ενεργοποιούμε τους κινητήρες
  motorBR.run(FORWARD);     //Ενεργοποιούμε τους κινητήρες
  motorFL.run(FORWARD);     //Ενεργοποιούμε τους κινητήρες
  motorBL.run(FORWARD);     //Ενεργοποιούμε τους κινητήρες
}

void loop() {
  imu.update();             //Ζητάμε τις νέες τιμές από το γυροσκόπιο
  mZ = imu.getAngleZ();     //Αποθηκεύουμε στην μεταβλητή mZ τις μοίρες της γωνίας περιστροφής γύρω από τον άξονα Ζ
  if (mZ < -1) {            //Αν η γωνία είναι μικρότερη από -1 μοίρα αυτό σημαίνει ότι το όχημα μας φεύγει δεξιά, άρα
    motorFR.setSpeed(200);  //Δίνω ταχύτητα στους δεξιά κινητήρες
    motorBR.setSpeed(200);  //Δίνω ταχύτητα στους δεξιά κινητήρες  
    motorFL.setSpeed(0);    //Και σταματάω τους αριστερούς  
    motorBL.setSpeed(0);    //Και σταματάω τους αριστερούς
  } else if (mZ > 1) {      //Αλλιώς αν η γωνία είναι μεγαλύτερη από 1 μοίρα αυτό σημαίνει ότι το όχημα μας φεύγει αριστερά, άρα
    motorFL.setSpeed(200);  //Δίνω ταχύτητα στους αριστερά κινητήρες
    motorBL.setSpeed(200);  //Δίνω ταχύτητα στους αριστερά κινητήρες
    motorFR.setSpeed(0);    //Και σταματάω τους δεξιά
    motorBR.setSpeed(0);    //Και σταματάω τους δεξιά
  } else {                  //Αλλιώς αυτό σημαίνει ότι το όχημα μας δεν φεύγει από την ευθεία (0 μοίρες) και άρα
    motorFL.setSpeed(200);  //Δίνω την ίδια ταχύτητα σε όλους τους κινητήρες
    motorBL.setSpeed(200);  //Δίνω την ίδια ταχύτητα σε όλους τους κινητήρες
    motorFR.setSpeed(200);  //Δίνω την ίδια ταχύτητα σε όλους τους κινητήρες
    motorBR.setSpeed(200);  //Δίνω την ίδια ταχύτητα σε όλους τους κινητήρες
  }
}
