/* Πρόγραμμα για τον έλεγχο λειτουργίας των κινητήρων στο αποχιονιστικό 1
 * Το πρόγραμμα λειτουργεί όλους τους κινητήρες μπροστά για 3 δευτερόλεπτα και 
 * μετά τους απενεργοποιεί για άλλα 3 δευτερόλεπτα. Η διαδικασία αυτή επαναλαμβάνεται
 * διαρκώς. Αν κάποιος κινητήρας κινείται ανάποδα μπορούμε να αντιστρέψουμε τα καλώδια του
 * στο Motor Driver Shield
 */ 
 
#include <AFMotor.h>    //Προσθέτουμε την βιβλιοθήκη για τον οδηγό των κινητήρων

AF_DCMotor motorFR(1);   //Ονομάζουμε motorFR τον κινητήρα που είναι στην θέση 1 του οδηγού κινητήρων και είναι στο μπροστά δεξί μέρος
AF_DCMotor motorFL(2);   //Ονομάζουμε motorFL τον κινητήρα που είναι στην θέση 2 του οδηγού κινητήρων και είναι στο μπροστά αριστερό μέρος
AF_DCMotor motorBL(3);   //Ονομάζουμε motorΒL τον κινητήρα που είναι στην θέση 3 του οδηγού κινητήρων και είναι στο πίσω αριστερό μέρος
AF_DCMotor motorBR(4);   //Ονομάζουμε motorBR τον κινητήρα που είναι στην θέση 4 του οδηγού κινητήρων και είναι στο πίσω δεξί μέρος


void setup() {
}

void loop() {
  motorFR.run(FORWARD);    //Ενεργοποιούμε τους δεξιά κινητήρες να κινηθούν μπροστά
  motorBR.run(FORWARD);    //Ενεργοποιούμε τους δεξιά κινητήρες να κινηθούν μπροστά
  motorFR.setSpeed(200);   //Ορίζουμε την ταχύτητα των δεξιά κινητήρων μεταξύ του 0-255
  motorBR.setSpeed(200);   //Ορίζουμε την ταχύτητα των δεξιά κινητήρων μεταξύ του 0-255
  motorFL.run(FORWARD);    //Ενεργοποιούμε τους αριστερά κινητήρες να κινηθούν μπροστά
  motorBL.run(FORWARD);    //Ενεργοποιούμε τους αριστερά κινητήρες να κινηθούν μπροστά
  motorFL.setSpeed(200);   //Ορίζουμε την ταχύτητα των αριστερά κινητήρων μεταξύ του 0-255
  motorBL.setSpeed(200);   //Ορίζουμε την ταχύτητα των αριστερά κινητήρων μεταξύ του 0-255
  delay(3000);             //Περιμένουμε 3 δευτερόλεπτα
   
  motorFR.run(RELEASE);    //Απενεργοποιούμε τους δεξιά κινητήρες
  motorBR.run(RELEASE);    //Απενεργοποιούμε τους δεξιά κινητήρες
  motorFL.run(RELEASE);    //Απενεργοποιούμε τους αριστερά κινητήρες
  motorBL.run(RELEASE);    //Απενεργοποιούμε τους αριστερά κινητήρες
  delay(3000);             //Περιμένουμε 3 δευτερόλεπτα
}
