/*
 Δοκιμαστικό πρόγραμμα για το ηχείο
 Το ενεργοποιεί κάθε δευτερόλεπτο
*/

#define pinS 27             //Ονομάζω pinS το pin 27 στο οποίο είναι συνδεδεμένο το ηχείο

void setup() {
  pinMode(pinS,OUTPUT);     //Ορίζουμε το pin του ηχείου ως έξοδος 
}

void loop() {               //Μέσα στο loop ενεργοποιώ και απενεργοποιώ διαρκώς το ηχείο
  digitalWrite(pinS,HIGH);  //Ενεργοποιώ το ηχείο
  delay(1000);              //Περιμένω 1 δευτερόλεπτο
  digitalWrite(pinS,LOW);   //Απενεργοποιώ το ηχείο
  delay(1000);              //Περιμένω 1 δευτερόλεπτο
}
