/*
 Δοκιμαστικό πρόγραμμα για την μονάδα IMU
 Διαβάζει τις τιμές της γωνίας περιστροφής
 γύρω από τον άξονα Ζ που παίρνει ο αισθητήρας 
 και τις εμφανίζει στο serial monitor.
*/

//Βιβλιοθήκες
#include <MPU6050_tockn.h>
#include <Wire.h>

//Μεταβλητές
MPU6050 imu(Wire);   //Δηλώνω την μονάδα με το όνομα imu
float mZ;            //Δηλώνω μια μεταβλητή που θα κρατάει τις μοίρες περιστροφής γύρω από τον άξονα Ζ

void setup() {
  Serial.begin(9600);         //Ξεκινάω την σειριακή επικοινωνία
  Wire.begin();               //Ξεκινάω τις βιβλιοθήκες για την μονάδα imu
  imu.begin();                //Ξεκινάω τις βιβλιοθήκες για την μονάδα imu
  imu.calcGyroOffsets(true);  //Υπολογίζω την απόκλιση της μονάδα imu (Θέλει 3 δευτερόλεπτα)
}

void loop() {
  imu.update();          //Ενημερώνω την μονάδα IMU     
  mZ = imu.getAngleZ();  //Παίρνω τις μοίρες περιστροφής γύρω από τον άξονα Ζ
  Serial.println(mZ);    //Τις εμφανίζω 
}
