/*  
 Δοκιμαστικό πρόγραμμα για τον αισθητήρα PIR
 Διαβάζει τις τιμές που παίρνει ο αισθητήρας 
 και εμφανίζει στο serial monitor αν υπάρχει κίνηση
*/

//Σταθερές 
#define pinP 25         //Ονομάζω pinP το pin 25 στο οποίο είναι συνδεδεμένος ο αισθητήρας PIR

//Μεταβλητές
int pir;                //Εδώ θα διαβάζουμε την τιμή από τον αισθητήρα PIR. Η τιμή αυτή μπορεί να είναι HIGH ή LOW δηλαδή 1 ή 0

void setup() {
  pinMode(pinP, INPUT); // Ορίζουμε το pin του αισθητήρα PIR ως είσοδο
  Serial.begin(9600);   // Ξεκινάμε την σειριακή επικοινωνία
}

void loop(){
  pir = digitalRead(pinP);            // Διαβάζουμε την τιμή του αισθητήρα PIR (θα είναι ή HIGH ή LOW)
  if (pir == HIGH) {                  // Ελέγχουμε αν είναι HIGH, που σημαίνει ότι υπάρχει κίνηση
    Serial.println("Κίνηση!");        // Εμφανίζουμε το μήνυμα ότι υπάρχει κίνηση 
  } else {                            // Αλλιώς αν είναι LOW, που σημαίνει πως δεν κινείται κάτι
    Serial.println("Τέλος Κίνησης!"); // Εμφανίζουμε το μήνυμα ότι τελείωσε η κίνηση    
  }
}
