/*  
 Δοκιμαστικό πρόγραμμα για τον αισθητήρα PIR
 Διαβάζει τις τιμές που παίρνει ο αισθητήρας 
 και εμφανίζει στο serial monitor αν υπάρχει κίνηση
*/

//Σταθερές 
#define pinPIR 25  // Ο PIR αισθητήρας είναι στο ψηφιακό pin 25

//Μεταβλητές
int state = LOW;  // Αρχικά ορίζουμε πως δεν υπάρχει κίνηση
int valPIR = 0;   // Εδώ θα διαβάζουμε την τιμή από τον αισθητήρα PIR

void setup() {
  pinMode(pinPIR, INPUT);    // Ορίζουμε το pin του αισθητήρα PIR ως είσοδο
  Serial.begin(9600);        // Ξεκινάμε την σειριακή επικοινωνία
}

void loop(){
  valPIR = digitalRead(pinPIR);   // Διαβάζουμε την τιμή του αισθητήρα PIR (θα είναι ή HIGH ή LOW)
  if (valPIR == HIGH) {              // Ελέγχουμε αν είναι HIGH, που σημαίνει ότι υπάρχει κίνηση
    if (state == LOW) {           // Αν προηγουμένως δεν υπήρχε κίνηση τότε
      Serial.println("Κίνηση!");  // Εμφανίζουμε το μήνυμα ότι υπάρχει κίνηση 
      state = HIGH;               
    }
  } else {                                // Αλλιώς αν είναι LOW, που σημαίνει πως δεν κινείται κάτι
      if (state == HIGH){                 // Αν προηγουμένως υπήρχε κίνηση
        Serial.println("Τέλος Κίνησης!"); // Εμφανίζουμε το μήνυμα ότι τελείωσε η κίνηση
        state = LOW;       
    }
  }
}
