/*
 Δοκιμαστικό πρόγραμμα για τον αισθητήρα βροχής/χιονιού
 Διαβάζει τις τιμές που παίρνει ο αισθητήρας, τι μετατρέπει
 σε τιμές από 1-100 και τις εμφανίζει στο serial monitor.
 Όταν είναι εντελώς στεγνός η τιμή του είναι κοντά στο 1023,
 ενώ όσο υπάρχει παραπάνω βροχή ή χιόνι η τιμή αυτή πέφτει προς το 0
 Σκοπός μας είναι να μετατρέψουμε τις τιμές μεταξύ 0-100 με 0 να είναι 
 ότι είναι στεγνός και το 100 να είναι η μέγιστη βροχόπτωση/χιονόπτωση
*/

#define pinR A15      //Ονομάζω pinR το αναλογικό pin 15 στο οποίο έχω συνδέσει τον αισθητήρα

float rain;           //Δημιουργώ μια μεταβλητή με το όνομα rain στην οποία θα αποθηκεύω την τιμή του αισθητήρα

void setup() {
  Serial.begin(9600); // Ξεκινάμε την σειριακή επικοινωνία
}

void loop() {
  rain = map(analogRead(pinR),0,1023,100,0);       // Διαβάζουμε την τιμή του αισθητήρα βροχής και την μετατρέπουμε σε μια τιμή από 0-100 χρησιμοποιώντας την map
  Serial.println(rain);                            // Εμφανίζουμε την τιμή του (0-1023) στην σειριακή οθόνη
}
