/*
 Δοκιμαστικό πρόγραμμα για τον αισθητήρα βροχής/χιονιού
 Διαβάζει τις τιμές που παίρνει ο αισθητήρας 
 και τις εμφανίζει στο serial monitor.
 Όταν είναι εντελώς στεγνός η τιμή του είναι κοντά στο 1023,
 ενώ όσο υπάρχει παραπάνω βροχή ή χιόνι η τιμή αυτή πέφτει προς το 0
*/

#define pinRain A15

float valRain;

void setup() {
  Serial.begin(9600); // Ξεκινάμε την σειριακή επικοινωνία
}

void loop() {
  valRain = analogRead(pinRain);    // Διαβάζουμε την τιμή του αισθητήρα βροχής
  Serial.println(valRain);      // Εμφανίζουμε την τιμή του (0-1023) στην σειριακή οθόνη
}
