/* Πρόγραμμα για τον έλεγχο λειτουργίας των κινητήρων servo στα αποχιονιστικά μας
 * Το πρόγραμμα λειτουργεί τους 2 κινητήρες και του μετακινεί μεταξύ δυο ακραίων θέσεων
 * Δουλειά μας είναι να διορθώσουμε τις θέσεις αυτές ώστε να μας βολεύουν καλύτερα για το κάθε μηχάνημα
 */ 

//Προσθήκη βιβλιοθήκων
#include <Servo.h>  //Βιβλιοθήκη για τον servo κινητήρα

//Μεταβλητές
Servo maxairi;   //Δηλώνω τον κινητήρα που ελέγχει το μαχαίρι
Servo alati;     //Δηλώνω τον κινητήρα που ελέγχει τον διασκορπιστή αλατιού 


void setup() {
  //Δηλώνω σε ποια pin του arduino έχω συνδέσει τους κινητήρες
  maxairi.attach(9); 
  alati.attach(10);  
}

void loop() {
  //Στρίβω τους κινητήρες στις 20 μοίρες και περιμένω 4 δευτερόλεπτα
  maxairi.write(20);
  alati.write(20);
  delay(3000);
  
  //Στρίβω τους κινητήρα στις 160 μοίρες και περιμένω 3 δευτερόλεπτα
  maxairi.write(160);
  alati.write(160);
  delay(3000);
}
