/* Πρόγραμμα για τον έλεγχο λειτουργίας των κινητήρων servo στα αποχιονιστικά μας
 * Το πρόγραμμα λειτουργεί τους 2 κινητήρες και του μετακινεί μεταξύ δυο ακραίων θέσεων
 * Δουλειά μας είναι να διορθώσουμε τις θέσεις αυτές ώστε να μας βολεύουν καλύτερα για το κάθε μηχάνημα
 */ 
 
//Προσθέτω την βιβλιοθήκη για τον servo κινητήρα
#include <Servo.h>

//Δηλώνω τον κινητήρα που ελέγχει το μαχαίρι
Servo maxairi;

//Δηλώνω τον κινητήρα που ελέγχει τον διασκορπιστή αλατιού
Servo alati;

void setup() {
  //Δηλώνω σε ποια pin του arduino έχω συνδέσει τους κινητήρες
  maxairi.attach(9); 
  alati.attach(10);  
}

void loop() {
  //Στρίβω τους κινητήρες στις 0 μοίρες και περιμένω 4 δευτερόλεπτα
  maxairi.write(0);
  alati.write(0);
  delay(3000);
  
  //Στρίβω τους κινητήρα στις 180 μοίρες και περιμένω 3 δευτερόλεπτα
  maxairi.write(180);
  alati.write(180);
  delay(3000);
}
