/* Πρόγραμμα για τον έλεγχο λειτουργίας των κινητήρων servo στα αποχιονιστικά μας
 * Το πρόγραμμα λειτουργεί τους 2 κινητήρες και του μετακινεί μεταξύ δυο ακραίων θέσεων
 * Δουλειά μας είναι να διορθώσουμε τις θέσεις αυτές ώστε να μας βολεύουν καλύτερα για το κάθε μηχάνημα
 */ 

//Προσθήκη βιβλιοθήκων
#include <Servo.h>  //Βιβλιοθήκη για τον servo κινητήρα

//Μεταβλητές
Servo front;        //Δηλώνω τον κινητήρα που ελέγχει το μαχαίρι
Servo back;         //Δηλώνω τον κινητήρα που ελέγχει τον διασκορπιστή αλατιού 


void setup() {
  front.attach(9);  //Ενεργοποιώ τον κινητήρα front ο οποίος είναι στην θέση SERVO1 του οδηγού, που αντιστοιχεί στο ψηφιακό pin 9
  back.attach(10);  //Ενεργοποιώ τον κινητήρα back ο οποίος είναι στην θέση SERVO2 του οδηγού, που αντιστοιχεί στο ψηφιακό pin 10
}

void loop() {
  front.write(20);  //Στρίβω και τους 2 κινητήρες στις 20 μοίρες
  back.write(20);   //Στρίβω και τους 2 κινητήρες στις 20 μοίρες
  delay(3000);      //Περιμένω 3 δευτερόλεπτα
  front.write(160); //Στρίβω και τους 2 κινητήρες στις 160 μοίρες
  back.write(160);  //Στρίβω και τους 2 κινητήρες στις 160 μοίρες
  delay(3000);      //Περιμένω 3 δευτερόλεπτα
}
