/*
  Πρόγραμμα για τον έλεγχο του αισθητήρα απόστασης
*/

#include <NewPing.h>              //Εισάγουμε την βιβλιοθήκη για τον αισθητήρα απόστασης υπέρηχων

#define pinD 23                   //Ονομάζουμε ως pinD το pin στο οποίο έχουμε συνδέσει και τις 2 υποδοχές (TRIG και ECHO) του αισθητήρα απόστασης

NewPing sonar(pinD, pinD, 400);   //Δημιουργούμε μια μονάδα αισθητήρα απόστασης υπέρηχων. Πρέπει να δηλώσουμε ποιο pin είναι το TRIG, ποιο το ECHO (τα έχουμε βάλει στο ίδιο) καθώς και το όριο σε εκατοστά
float cm;                         //Εδώ θα διαβάζουμε την τιμή από τον αισθητήρα απόστασης σε εκατοστά


void setup() {
  Serial.begin(9600);             //Ξεκινάω την σειριακή επικοινωνία
}

void loop() {
  cm = sonar.ping_cm();           //Διαβάζω την απόσταση σε εκατοστά από τον αισθητήρα
  Serial.println(cm);             //Τα εμφανίζω στην σειριακή οθόνη
}
