/*
  Πρόγραμμα για τον έλεγχο του αισθητήρα απόστασης
*/

//Εισάγουμε όλες τις βιβλιοθήκες
#include <NewPing.h>        //Αισθητήρας απόστασης υπέρηχων

//Ορίζουμε τα pin στα οποία έχουμε συνδέσει τις μονάδες
#define pinDist 23  //Αισθητήρας απόστασης

//Δημιουργούμε αντικείμενα - μεταβλητές
NewPing sonar(pinDist, pinDist, 400);   //Μονάδα αισθητήρα απόστασης υπέρηχων
int cm;                                 //Εδώ θα διαβάζουμε την τιμή από τον αισθητήρα απόστασης σε εκατοστά


void setup() {
  Serial.begin(9600); //Ξεκινάω την σειριακή επικοινωνία
}

void loop() {
  cm = sonar.ping_cm(); //Διαβάζω την απόσταση σε εκατοστά από τον αισθητήρα
  Serial.println(cm);   //Τα εμφανίζω στην σειριακή οθόνη
}
