/*
  Πρόγραμμα δοκιμής βηματικού κινητήρα
*/

#include <Stepper.h>                  //Εισάγω την βιβλιοθήκη για τον βηματικό κινητήρα

Stepper motor(1019, 35, 37, 39, 41);  //Δηλώνω έναν βηματικό κινητήρα με το όνομα motor, ο οποίος θα έχει 1019 βήμα για 1 περιστροφή και είναι τοποθετημένος στα pin 35,37,39 και 41 του arduino

void setup() {
}

void loop() {
  stepper.setSpeed(6);                //Ορίζω την ταχύτητα σε 6 περιστροφές ανά λεπτό
  stepper.step(1);                    //Περιστρέφω τον κινητήρα για 1 βήμα
}
