/*
 Δοκιμαστικό πρόγραμμα για τον αισθητήρα θερμοκρασίας
 Διαβάζει τις τιμές που παίρνει ο αισθητήρας 
 και τις εμφανίζει στο serial monitor.
*/

#include <dht.h> //Εισάγουμε την βιβλιοθήκη του αισθητήρα θερμοκρασίας

#define pinTemp A14

dht DHT;         
  

void setup() {
Serial.begin(9600);   //Ξεκινάμε την σειριακή επικοινωνία
}

void loop() {
  DHT.read11(pinTemp);              //Διαβάζουμε τις τιμές από τον αισθητήρα
  float temp = DHT.temperature;     //Παίρνουμε την θερμοκρασία
  Serial.println(temp);             //την εμφανίζουμε στην σειριακή οθόνη
}
